package io.demo.weichai.req;

import java.util.Arrays;
import java.util.List;

public class Dictionary {
	
	private static List<String> paramsKey = Arrays.asList(new String[] {
			"整车型号","发动机型号","发动机订货号",
			"型号","主要特征","型式","缸数×缸径×行程","活塞总排量","标定功率","标定转速","最大扭矩","最大扭矩转速",
			"最低稳定转速","最高空载转速","最低燃油耗","机油燃油消耗比","排放限值","噪声限值","允许倾斜角度",
			"发动机适应温度","适用海拔高度","发动机净质量","安装方式","整车型号","车型级别","主要用途",
			"整备质量（t）","总质量（t）","设计车速（km/h）","常用车速（km/h）","外形尺寸（mm）","使用区域（寒、热）",
			"使用海拔（m）","发动机安装位置","其它说明","型式","规格","型号","生产厂家","额定输入功率（kW）","额定输入扭矩（N.m）",
			"档位","各档速比","一轴长度","离合器壳厚度","一轴小头长度","是否带液力缓速器","额定缓速力矩（N.m）","主减速比",
			"额定输入扭矩（N.m）","型号","滚动半径","是否配置及安装位置","用电功率","驱动功率","制冷量","功率","数量","型式",
			"叶数","外径","投影宽度","安装位置说明","驱动功率","型号","生产厂家","额定流量","允许最大压降","散热面积",
			"芯部尺寸","型号","厂家","进气流量","原始阻力","滤清效率","型号","插入损失","阻力","型号/型式","散热面积","芯部尺寸",
			"进出水压差","容量","泄荷压力","型号","溢流阀","流量","压力","规格","空滤阻力","进气阻力","中冷器压力降",
			"排气背压","水箱散热器温降","中冷器温降","极限环境使用温度","布置方式","发动机质心","沿曲轴中心的转动惯量",
			"是否随发动机提供","安装位置","是否随发动机提供","是否随发动机提供","安装位置","是否随发动机提供","SAE标准号",
			"厚度","是否随发动机提供","规格","适配离合器压盘外径","摩擦面到飞轮壳后端面距离","齿圈齿数","是否随发动机提供",
			"规格","是否随发动机提供","型号","一轴轴承后端面到飞轮壳后端面距离","各槽槽型","各槽外径","各槽中心至机体前端面",
			"皮带轮前端至飞轮壳后端面","是否随发动机提供","型号","厂家","安装位置","规格","方向","坐标","连接方式","排气管密封垫片",
			"开启温度","全开温度","油池位置","油温接口","参考容量","抽出方向","位置","规格或型号","长度","电压/功率","最大启动电流",
			"持续启动电流","是否全密封性","接线型式","在发动机上的位置","接线柱规格","规格型号","发动机所带发电机数量","电压",
			"电流/功率","相输出端","传动比","最大功率时转速","开始充电时转速","B+，D+，E-螺纹规格","带轮节径X槽数X槽型",
			"接口规格","位置","位置及安装距离","额定排量","额定工作压力","取气方式","密封形式","旋向","公称排量","控制流量",
			"最大压力","螺纹深度","有无电加热装置","有无油中有水传感器","有无手压泵","进回油管路要求","插接件规格","插接件外壳规格",
			"BMK0.6mm端子规格","BDK2.8mm端子规格","盲堵规格","通堵规格","护套规格","端子规格","防水拴规格","开关组件规格",
			"防水塞规格","接插件规格","电压（V）","功率（kW）","厚度（mm）","止口直径（mm）"
	});
	
	public static boolean isParameter(String text) {
		return paramsKey.contains(text);
	}
}
